# GetOffsetDistance Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OffsetSurface..::..GetOffsetDistance Method
OffsetSurface Class See Also
---
Returns offset distance of this OffsetSurface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public double GetOffsetDistance()
```

Visual Basic
---
```text
Public Function GetOffsetDistance As Double
```

Visual C++
---
```text
public:
double GetOffsetDistance()
```

# ### Return Value
Offset distance of this OffsetSurface.
# See Also
OffsetSurface Class
Autodesk.Revit.DB Namespace